src_test/test-ws-handlers/docs/handler-test-results/co-ok-si-tr.txt


Handler C... error behaviour:

|--------- |--------------|------------------------|---------------------------|
|          | return false | throw RuntimeException | throw SOAPFaultException  |
|----------|--------------|------------------------|---------------------------|
|Client OUT|              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Server IN |              |           X            |                           |
|----------|--------------|------------------------|---------------------------|
|Client IN |              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Server OUT|              |                        |                           |
|----------|--------------|------------------------|---------------------------|


Trace:
--------------------------------------------------------------------------------
Client-side
                    Server-side
--------------------------------------------------------------------------------

                    INFO: WSSERVLET12: JAX-WS context listener initializing
                    handler.server.HandlerAdams@4dd014> (constructor)
                    handler.server.HandlerBoston@97f621> (constructor)
                    handler.server.HandlerChicago@a02839> (constructor)
                    handler.server.HandlerDenver@b0ede6> (constructor)
                    handler.server.HandlerEasy@1d29a78> (constructor)
                    2/Mai/2008 17:56:02 com.sun.xml.ws.transport.http.servlet.WSServletDelegate init

                    INFO: WSSERVLET14: JAX-WS servlet initializing


Running the hello.HelloServiceClient program...
handler.client.HandlerAlpha@fefe3f> (constructor)
handler.client.HandlerBravo@c2b2f6> (constructor)
handler.client.HandlerCharlie@1a001ff> (constructor)
handler.client.HandlerDelta@90c06f> (constructor)
handler.client.HandlerEcho@1267649> (constructor)
handler.client.HandlerAlpha@fefe3f> getHeaders()
handler.client.HandlerBravo@c2b2f6> getHeaders()
handler.client.HandlerCharlie@1a001ff> getHeaders()
handler.client.HandlerDelta@90c06f> getHeaders()
handler.client.HandlerEcho@1267649> getHeaders()
Outbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></soapenv:Body></soapenv:Envelope>
handler.client.HandlerAlpha@fefe3f> handleMessage() - Outbound SOAP message
handler.client.HandlerBravo@c2b2f6> handleMessage() - Outbound SOAP message
handler.client.HandlerCharlie@1a001ff> handleMessage() - Outbound SOAP message
handler.client.HandlerDelta@90c06f> handleMessage() - Outbound SOAP message
handler.client.HandlerEcho@1267649> handleMessage() - Outbound SOAP message
Outbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></soapenv:Body></soapenv:Envelope>


                    handler.server.HandlerAdams@4dd014> getHeaders()
                    handler.server.HandlerBoston@97f621> getHeaders()
                    handler.server.HandlerChicago@a02839> getHeaders()
                    handler.server.HandlerDenver@b0ede6> getHeaders()
                    handler.server.HandlerEasy@1d29a78> getHeaders()
                    Inbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></
                    soapenv:Body></soapenv:Envelope>
                    handler.server.HandlerEasy@1d29a78> handleMessage() - Inbound SOAP message
                    handler.server.HandlerDenver@b0ede6> handleMessage() - Inbound SOAP message
                    handler.server.HandlerChicago@a02839> handleMessage() - Inbound SOAP message
                    handler.server.HandlerChicago@a02839 throwing runtime exception
                    handler.server.HandlerEasy@1d29a78> close()
                    handler.server.HandlerDenver@b0ede6> close()
                    handler.server.HandlerChicago@a02839> close()


Inbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><soapenv:Fault xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><faultcode>soapenv:Server</faultcode><faultstring>Server Inbound - Runtime Exception!</faultstring></soapenv:Fault></soapenv:Body></soapenv:Envelope>
handler.client.HandlerEcho@1267649> handleMessage() - Inbound SOAP message
handler.client.HandlerDelta@90c06f> handleMessage() - Inbound SOAP message
handler.client.HandlerCharlie@1a001ff> handleMessage() - Inbound SOAP message
handler.client.HandlerBravo@c2b2f6> handleMessage() - Inbound SOAP message
handler.client.HandlerAlpha@fefe3f> handleMessage() - Inbound SOAP message
Inbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><soapenv:Fault xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><faultcode>soapenv:Server</faultcode><faultstring>Server Inbound - Runtime Exception!</faultstring></soapenv:Fault></soapenv:Body></soapenv:Envelope>
handler.client.HandlerEcho@1267649> close()
handler.client.HandlerDelta@90c06f> close()
handler.client.HandlerCharlie@1a001ff> close()
handler.client.HandlerBravo@c2b2f6> close()
handler.client.HandlerAlpha@fefe3f> close()
Exception in thread "main" javax.xml.ws.soap.SOAPFaultException: Server Inbound - Runtime Exception!
	at com.sun.xml.ws.encoding.soap.ClientEncoderDecoder.toMessageInfo(ClientEncoderDecoder.java:80)
	at com.sun.xml.ws.encoding.soap.client.SOAPXMLDecoder.toMessageInfo(SOAPXMLDecoder.java:200)
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.receive(SOAPMessageDispatcher.java:549)
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.doSend(SOAPMessageDispatcher.java:288)
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.send(SOAPMessageDispatcher.java:153)
	at com.sun.xml.ws.encoding.soap.internal.DelegateBase.send(DelegateBase.java:85)
	at com.sun.xml.ws.client.EndpointIFInvocationHandler.implementSEIMethod(EndpointIFInvocationHandler.java:176)
	at com.sun.xml.ws.client.EndpointIFInvocationHandler.invoke(EndpointIFInvocationHandler.java:105)
	at $Proxy18.sayHello(Unknown Source)
	at hello.HelloServiceClient.main(HelloServiceClient.java:10)
